## Librería Pandas
Utilización de la función lambda para crear nuevas columnas de un dataframe

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [79]:
array_gaus = np.random.normal(3,1,1000000)

In [80]:
df = pd.DataFrame(data=array_gaus, columns=["Valores"])

In [81]:
df

         Valores
0       2.639343
1       3.978790
2       4.053000
3       1.869289
4       6.144783
...          ...
999995  1.402480
999996  4.022633
999997  2.507717
999998  2.893497
999999  2.318515

[1000000 rows x 1 columns]

In [82]:
df["Valores_cuadrado"]=df["Valores"].apply(lambda x:x**2)

In [83]:
df

         Valores  Valores_cuadrado
0       2.639343          6.966131
1       3.978790         15.830767
2       4.053000         16.426810
3       1.869289          3.494243
4       6.144783         37.758355
...          ...               ...
999995  1.402480          1.966950
999996  4.022633         16.181580
999997  2.507717          6.288645
999998  2.893497          8.372325
999999  2.318515          5.375511

[1000000 rows x 2 columns]

In [65]:
df2 = pd.DataFrame({"Artículo":["A","B","C","D"],"Precio":["4.85$","5.23$","7.85$","4.25$"],"Cantidad":[2,3,1,6]})

In [40]:
df2

  Artículo Precio  Cantidad
0        A  4.85$         2
1        B  5.23$         3
2        C  7.85$         1
3        D  4,25$         6

In [26]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
Artículo    4 non-null object
Precio      4 non-null object
dtypes: object(2)
memory usage: 192.0+ bytes

In [41]:
df2["Precio"]=df2["Precio"].apply(lambda x:x.replace("$", "€"))

In [42]:
df2

  Artículo Precio  Cantidad
0        A  4.85€         2
1        B  5.23€         3
2        C  7.85€         1
3        D  4,25€         6

In [66]:
df2["Precio"]=df2["Precio"].apply(lambda x:x.replace("$", ""))

In [60]:
df2

  Artículo Precio  Cantidad
0        A   4.85         2
1        B   5.23         3
2        C   7.85         1
3        D   4.25         6

In [67]:
df2["Precio"]=pd.to_numeric(df2["Precio"])
df2["Cantidad"]=pd.to_numeric(df2["Cantidad"])

In [62]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
Artículo    4 non-null object
Precio      4 non-null float64
Cantidad    4 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 224.0+ bytes

In [68]:
df2["Total Venta"]=df2.apply(lambda x:x["Precio"]*x["Cantidad"],axis=1)

In [69]:
df2

  Artículo  Precio  Cantidad  Total Venta
0        A    4.85         2         9.70
1        B    5.23         3        15.69
2        C    7.85         1         7.85
3        D    4.25         6        25.50

# Ejercicio

In [84]:
df_iris = pd.read_csv(r'./Datasets/iris_dataset.csv',encoding = "ISO-8859-1",delimiter=',')

In [85]:
df_iris

,longitud_sépalo,anchura_sépalo,longitud_pétalo,anchura_pétalo,clase
0,5.1,3.5,1.4,0.2,Iris-setosa
1,4.9,3.0,1.4,0.2,Iris-setosa
2,4.7,3.2,1.3,0.2,Iris-setosa
3,4.6,3.1,1.5,0.2,Iris-setosa
4,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,Iris-virginica
146,6.3,2.5,5.0,1.9,Iris-virginica
147,6.5,3.0,5.2,2.0,Iris-virginica
148,6.2,3.4,5.4,2.3,Iris-virginica
149,5.9,3.0,5.1,1.8,Iris-virginica

In [86]:
df_iris["Área_pétalo"] = df_iris.apply(lambda x:x["longitud_pétalo"]*x["anchura_pétalo"]*3.14,axis=1)

In [87]:
import numpy as np

In [88]:
df_iris["Área_pétalo"] = df_iris.apply(lambda x:x["longitud_pétalo"]*x["anchura_pétalo"]*np.pi,axis=1)

In [89]:
df_iris

,longitud_sépalo,anchura_sépalo,longitud_pétalo,anchura_pétalo,clase,Área_pétalo
0,5.1,3.5,1.4,0.2,Iris-setosa,0.879646
1,4.9,3.0,1.4,0.2,Iris-setosa,0.879646
2,4.7,3.2,1.3,0.2,Iris-setosa,0.816814
3,4.6,3.1,1.5,0.2,Iris-setosa,0.942478
4,5.0,3.6,1.4,0.2,Iris-setosa,0.879646
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,Iris-virginica,37.573448
146,6.3,2.5,5.0,1.9,Iris-virginica,29.845130
147,6.5,3.0,5.2,2.0,Iris-virginica,32.672564
148,6.2,3.4,5.4,2.3,Iris-virginica,39.018581
149,5.9,3.0,5.1,1.8,Iris-virginica,28.839821

In [90]:
df_iris["Área_pétalo"].median()

17.640042749906687

In [91]:
df_iris["Área_pétalo"].quantile(0.9)

38.9337577559383

In [92]:
df_iris.corr()

,longitud_sépalo,anchura_sépalo,longitud_pétalo,anchura_pétalo,Área_pétalo
longitud_sépalo,1.000000,-0.109369,0.871754,0.817954,0.857326
anchura_sépalo,-0.109369,1.000000,-0.420516,-0.356544,-0.280612
longitud_pétalo,0.871754,-0.420516,1.000000,0.962757,0.958472
anchura_pétalo,0.817954,-0.356544,0.962757,1.000000,0.980229
Área_pétalo,0.857326,-0.280612,0.958472,0.980229,1.000000